In [10]:
d1 = {'A':'Alpha','B':'Beta','C':'Gamma'}
d1

{'A': 'Alpha', 'B': 'Beta', 'C': 'Gamma'}

In [3]:
l1 = []
l1.extend(d1.keys())

In [4]:
l1

[1, 2, 3]

In [5]:
l1.extend(d1.items())

In [6]:
l1

[1, 2, 3, (1, 1), (2, 2), (3, 3)]

In [14]:
l = []
for i in d1.items():
    l.extend(i)
l

['A', 'Alpha', 'B', 'Beta', 'C', 'Gamma']

In [17]:
data = {'ID101':['Aniruddha','Kalbande',35,'India'],
       'ID102':['Ankitha','R',15,'USA'],
       'ID103':['Rahul','Kumar',23,'Pakistan']}
age =[]
country = []
for i in data:
    age.append(data[i][2])
    country.append(data[i][3])
country

['India', 'USA', 'Pakistan']

In [18]:
import numpy as np

In [46]:
marks1 = np.random.randint(1,101,10)
marks2 = np.random.randint(1,101,10)
print(marks1)
print(marks2)
np.where(marks1<40,marks2,'Passed')

[99 26 95 90  4 55 96  3 17 75]
[28  4 53 95 29 53 28 37 31 40]

array(['Passed', '4', 'Passed', 'Passed', '29', 'Passed', 'Passed', '37',
       '31', 'Passed'], dtype='<U11')

In [22]:
import pandas as pd

In [43]:
test1 = pd.Series(marks1,list('ABCDEFGHIJ'))
test2 = pd.Series(marks2,list('ABCDEFGHIJ'))

In [44]:
test1

A    52
B    95
C    40
D    69
E    97
F    89
G    46
H    20
I    43
J    35
dtype: int32

In [25]:
test2

A    22
B    97
C    96
D    68
E    79
F     7
G    46
H    20
I    96
J    35
dtype: int32

In [42]:
test1[test1<40]=test2
test1

A    52
B    95
C    40
D    69
E    97
F    89
G    46
H    20
I    43
J    35
dtype: int32

In [47]:
df1 = pd.DataFrame()
df1['Marks 1'] = marks1
df1['Marks 2'] = marks2
df1

   Marks 1  Marks 2
0       99       28
1       26        4
2       95       53
3       90       95
4        4       29
5       55       53
6       96       28
7        3       37
8       17       31
9       75       40

In [53]:
df1['Marks 3'] = np.where((df1['Marks 1']>40) & (df1['Marks 2']>40),'Pass','Fail')

In [54]:
df1

   Marks 1  Marks 2 Marks 3
0       99       28    Fail
1       26        4    Fail
2       95       53    Pass
3       90       95    Pass
4        4       29    Fail
5       55       53    Pass
6       96       28    Fail
7        3       37    Fail
8       17       31    Fail
9       75       40    Fail

In [55]:
t = lambda y : 'pass' if y['Marks 1']> 40 and y['Marks 2']>40 else 'fail'  
df1['Result'] = df1[['Marks 1','Marks 2']].apply(t,axis=1)
df1

   Marks 1  Marks 2 Marks 3 Result
0       99       28    Fail   fail
1       26        4    Fail   fail
2       95       53    Pass   pass
3       90       95    Pass   pass
4        4       29    Fail   fail
5       55       53    Pass   pass
6       96       28    Fail   fail
7        3       37    Fail   fail
8       17       31    Fail   fail
9       75       40    Fail   fail

In [1]:
(1,2)+(3,4)

(1, 2, 3, 4)